In [0]:
# Data Creation

data=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17)]

schema = ["id","name","sal","mngr_id"]
df = spark.createDataFrame(data=data, schema=schema)

df.show()


schema1 = ["id","emp_name","sal","mngr_id"]
data1=[(19 ,'Sohan',50000, 18),
(20 ,'Sima',75000,  17),
(18 ,'Sam',65000,   17)]

df1 = spark.createDataFrame(data=data1, schema=schema1)

df1.show()

data_diff = [('sohan',19 ,50000, 18),
('sima',20 ,75000,  17)]

schema_diff = ["emp_name","id","sal","mngr_id"]

diff = spark.createDataFrame(data=data_diff,schema=schema_diff)
diff.show()

+---+------+-----+-------+
| id|  name|  sal|mngr_id|
+---+------+-----+-------+
| 10|  Anil|50000|     18|
| 11| Vikas|75000|     16|
| 12| Nisha|40000|     18|
| 13| Nidhi|60000|     17|
| 14| Priya|80000|     18|
| 15| Mohit|45000|     18|
| 16|Rajesh|90000|     10|
| 17| Raman|55000|     16|
| 18|   Sam|65000|     17|
+---+------+-----+-------+

+---+--------+-----+-------+
| id|emp_name|  sal|mngr_id|
+---+--------+-----+-------+
| 19|   Sohan|50000|     18|
| 20|    Sima|75000|     17|
| 18|     Sam|65000|     17|
+---+--------+-----+-------+

+--------+---+-----+-------+
|emp_name| id|  sal|mngr_id|
+--------+---+-----+-------+
|   sohan| 19|50000|     18|
|    sima| 20|75000|     17|
+--------+---+-----+-------+

In [0]:
df.union(df1).show() #Column name will be used of the coloums of which u are using as start here in this case df
df.unionAll(df1).show() #unionAll

'''
With respect to dataframe union and unionAll will give you same result that is duplicates will be inlcuded as well it will take both the table and add all rows together 

on the other hand if you use sql or spark sql then when using union the output will give you table and will not consider duplicate and unionAll will also take duplicate 

'''

+---+------+-----+-------+
| id|  name|  sal|mngr_id|
+---+------+-----+-------+
| 10|  Anil|50000|     18|
| 11| Vikas|75000|     16|
| 12| Nisha|40000|     18|
| 13| Nidhi|60000|     17|
| 14| Priya|80000|     18|
| 15| Mohit|45000|     18|
| 16|Rajesh|90000|     10|
| 17| Raman|55000|     16|
| 18|   Sam|65000|     17|
| 19| Sohan|50000|     18|
| 20|  Sima|75000|     17|
| 18|   Sam|65000|     17|
+---+------+-----+-------+

+---+------+-----+-------+
| id|  name|  sal|mngr_id|
+---+------+-----+-------+
| 10|  Anil|50000|     18|
| 11| Vikas|75000|     16|
| 12| Nisha|40000|     18|
| 13| Nidhi|60000|     17|
| 14| Priya|80000|     18|
| 15| Mohit|45000|     18|
| 16|Rajesh|90000|     10|
| 17| Raman|55000|     16|
| 18|   Sam|65000|     17|
| 19| Sohan|50000|     18|
| 20|  Sima|75000|     17|
| 18|   Sam|65000|     17|
+---+------+-----+-------+

In [0]:
# If column order is not same it will still do union but data will be a mess
diff.union(df1).show() 

# To avoid this we do unionByName what this will do is while doing union spark will find column name match it and put data below it 
# We can also use select statement and select in particular order then use union (alternative)

#IMP unionByName should only be used when you know the column names will be same, if not same and you want to do proper union then use select and create a proper order between the 2 dataframes and then use union so this will give you result then 
# How it would look like: df1.select("columns with same order").union(df2.select("columns with same order")) here columns name could be different but order if mainted same then union will work correctly 

diff.unionByName(df1).show()

# ALways in all union column names are used of first dataframe that you use in code

+--------+-----+-----+-------+
|emp_name|   id|  sal|mngr_id|
+--------+-----+-----+-------+
|   sohan|   19|50000|     18|
|    sima|   20|75000|     17|
|      19|Sohan|50000|     18|
|      20| Sima|75000|     17|
|      18|  Sam|65000|     17|
+--------+-----+-----+-------+

+--------+---+-----+-------+
|emp_name| id|  sal|mngr_id|
+--------+---+-----+-------+
|   sohan| 19|50000|     18|
|    sima| 20|75000|     17|
|   Sohan| 19|50000|     18|
|    Sima| 20|75000|     17|
|     Sam| 18|65000|     17|
+--------+---+-----+-------+

In [0]:
# Now we will learn about case when situations 

emp_data = [
(1,'manish',26,20000,'india','IT'),
(2,'rahul',None,40000,'germany','engineering'),
(3,'pawan',12,60000,'india','sales'),
(4,'roshini',44,None,'uk','engineering'),
(5,'raushan',35,70000,'india','sales'),
(6,None,29,200000,'uk','IT'),
(7,'adam',37,65000,'us','IT'),
(8,'chris',16,40000,'us','sales'),
(None,None,None,None,None,None),
(7,'adam',37,65000,'us','IT')
]

schema = ['id','name','age','salary','country','dept']
df = spark.createDataFrame(data=emp_data, schema=schema)

In [0]:
#pySpark distinct() transformation is used to drop/remove the duplicate rows (all columns) from DataFrame and dropDuplicates() is used to drop rows based on selected (one or multiple) columns. distinct() and dropDuplicates() returns a new DataFrame. In this article, you will learn how to use distinct() and dropDuplicates() functions with PySpark example.


df = df.distinct()

In [0]:
'''if you want to drop any row in which any value is null, use

df.na.drop()  //same as df.na.drop("any") default is "any"
or
df.na.drop(subset=['columns']) //for specific columns
to drop only if all values are null for that row, use
df.na.drop("all")

'''

df = df.na.drop('all')

In [0]:
df.show()

+---+-------+----+------+-------+-----------+
| id|   name| age|salary|country|       dept|
+---+-------+----+------+-------+-----------+
|  1| manish|  26| 20000|  india|         IT|
|  2|  rahul|null| 40000|germany|engineering|
|  3|  pawan|  12| 60000|  india|      sales|
|  4|roshini|  44|  null|     uk|engineering|
|  5|raushan|  35| 70000|  india|      sales|
|  6|   null|  29|200000|     uk|         IT|
|  7|   adam|  37| 65000|     us|         IT|
|  8|  chris|  16| 40000|     us|      sales|
+---+-------+----+------+-------+-----------+

In [0]:
from pyspark.sql.functions import *
from pyspark.sql.types import *

df.withColumn("adult", when(col('age')>=18,"Yes").when(col('age').isNull(),"Not Mentioned").otherwise("No")).show()

+---+-------+----+------+-------+-----------+-------------+
| id|   name| age|salary|country|       dept|        adult|
+---+-------+----+------+-------+-----------+-------------+
|  1| manish|  26| 20000|  india|         IT|          Yes|
|  2|  rahul|null| 40000|germany|engineering|Not Mentioned|
|  3|  pawan|  12| 60000|  india|      sales|           No|
|  4|roshini|  44|  null|     uk|engineering|          Yes|
|  5|raushan|  35| 70000|  india|      sales|          Yes|
|  6|   null|  29|200000|     uk|         IT|          Yes|
|  7|   adam|  37| 65000|     us|         IT|          Yes|
|  8|  chris|  16| 40000|     us|      sales|           No|
+---+-------+----+------+-------+-----------+-------------+

In [0]:
# to set a default value to null for a particular column you have replace na function but if want to do with when then

df.withColumn("age", when(col("age").isNull(),20).otherwise(col("age"))).show()

#althernative

df.fillna(value=20, subset=['age']).show()

+---+-------+---+------+-------+-----------+
| id|   name|age|salary|country|       dept|
+---+-------+---+------+-------+-----------+
|  1| manish| 26| 20000|  india|         IT|
|  2|  rahul| 20| 40000|germany|engineering|
|  3|  pawan| 12| 60000|  india|      sales|
|  4|roshini| 44|  null|     uk|engineering|
|  5|raushan| 35| 70000|  india|      sales|
|  6|   null| 29|200000|     uk|         IT|
|  7|   adam| 37| 65000|     us|         IT|
|  8|  chris| 16| 40000|     us|      sales|
+---+-------+---+------+-------+-----------+

+---+-------+---+------+-------+-----------+
| id|   name|age|salary|country|       dept|
+---+-------+---+------+-------+-----------+
|  1| manish| 26| 20000|  india|         IT|
|  2|  rahul| 20| 40000|germany|engineering|
|  3|  pawan| 12| 60000|  india|      sales|
|  4|roshini| 44|  null|     uk|engineering|
|  5|raushan| 35| 70000|  india|      sales|
|  6|   null| 29|200000|     uk|         IT|
|  7|   adam| 37| 65000|     us|         IT|
|  8|  chris| 16| 40000|     us|      sales|
+---+-------+---+------+-------+-----------+

In [0]:
#if you want to use and in when case you have to enclose your col
# example: df.withColumn("column", when( (col('age')>0) & (col('age')<18) ,minor ) ) 
# like this both col should be enclose only then will and or conditions will work

In [0]:
#sorting data in spark
# By default its ascending
df.sort(col("salary")).show()
# if want desecnding
df.sort(col("salary").desc()).show()
"OR"
df.sort(desc("salary")).show()
# can use multiple columns with , as well

+---+-------+----+------+-------+-----------+
| id|   name| age|salary|country|       dept|
+---+-------+----+------+-------+-----------+
|  4|roshini|  44|  null|     uk|engineering|
|  1| manish|  26| 20000|  india|         IT|
|  2|  rahul|null| 40000|germany|engineering|
|  8|  chris|  16| 40000|     us|      sales|
|  3|  pawan|  12| 60000|  india|      sales|
|  7|   adam|  37| 65000|     us|         IT|
|  5|raushan|  35| 70000|  india|      sales|
|  6|   null|  29|200000|     uk|         IT|
+---+-------+----+------+-------+-----------+

+---+-------+----+------+-------+-----------+
| id|   name| age|salary|country|       dept|
+---+-------+----+------+-------+-----------+
|  6|   null|  29|200000|     uk|         IT|
|  5|raushan|  35| 70000|  india|      sales|
|  7|   adam|  37| 65000|     us|         IT|
|  3|  pawan|  12| 60000|  india|      sales|
|  2|  rahul|null| 40000|germany|engineering|
|  8|  chris|  16| 40000|     us|      sales|
|  1| manish|  26| 20000|  india|         IT|
|  4|roshini|  44|  null|     uk|engineering|
+---+-------+----+------+-------+-----------+

+---+-------+----+------+-------+-----------+
| id|   name| age|salary|country|       dept|
+---+-------+----+------+-------+-----------+
|  6|   null|  29|200000|     uk|         IT|
|  5|raushan|  35| 70000|  india|      sales|
|  7|   adam|  37| 65000|     us|         IT|
|  3|  pawan|  12| 60000|  india|      sales|
|  2|  rahul|null| 40000|germany|engineering|
|  8|  chris|  16| 40000|     us|      sales|
|  1| manish|  26| 20000|  india|         IT|
|  4|roshini|  44|  null|     uk|engineering|
+---+-------+----+------+-------+-----------+